In [1]:
import mysql.connector

In [2]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="sneha_ptl"
)

In [3]:
mycursor = mydb.cursor()

In [4]:
mycursor.execute("USE library_db")

In [5]:
mycursor = mydb.cursor()

sql = "DROP TABLE IF EXISTS Books"

mycursor.execute(sql)

In [6]:
query = """
CREATE TABLE Books(
book_id INT AUTO_INCREMENT PRIMARY KEY,
title VARCHAR(255) NOT NULL,
author VARCHAR(255) NOT NULL,
genre VARCHAR(100),
published_year YEAR,
is_available BOOLEAN DEFAULT TRUE);
"""
mycursor.execute(query)

In [7]:
def insert_Books(book_id,title,author,genre,published_year,is_available): 
    query = "INSERT INTO Books (book_id, title, author, genre, published_year, is_available) " \
            "VALUES (%s, %s, %s, %s, %s, %s)"
    values = (book_id,title,author,genre,published_year,is_available) 
    try: 
        mycursor.execute(query, values) 
        mydb.commit() 
        print("Book inserted successfully.") 
    except mysql.connector.Error as err: 
        print(f"Error inserting book: {err}") 
 
insert_Books("2", "The Jungle Book", "Rudyard Kipling", "Fable", "2025", True)

Book inserted successfully.

In [8]:
def insert_Books(book_id,title,author,genre,published_year,is_available): 
    query = "INSERT INTO Books (book_id, title, author, genre, published_year, is_available) " \
            "VALUES (%s, %s, %s, %s, %s, %s)"
    values = (book_id,title,author,genre,published_year,is_available) 
    try: 
        mycursor.execute(query, values) 
        mydb.commit() 
        print("Book inserted successfully.") 
    except mysql.connector.Error as err: 
        print(f"Error inserting book: {err}") 
 
insert_Books("3", "The Silent Patient", "Alex Michaelides", "Psychological Thriller", "2019", True)

Book inserted successfully.

In [9]:
def insert_Books(book_id,title,author,genre,published_year,is_available): 
    query = "INSERT INTO Books (book_id, title, author, genre, published_year, is_available) " \
            "VALUES (%s, %s, %s, %s, %s, %s)"
    values = (book_id,title,author,genre,published_year,is_available) 
    try: 
        mycursor.execute(query, values) 
        mydb.commit() 
        print("Book inserted successfully.") 
    except mysql.connector.Error as err: 
        print(f"Error inserting book: {err}") 
 
insert_Books("1","Sapiens", "Yuval Noah Harari", "History", "2011", True)

Book inserted successfully.

In [10]:
def insert_Books(book_id,title,author,genre,published_year,is_available): 
    query = "INSERT INTO Books (book_id, title, author, genre, published_year, is_available) " \
            "VALUES (%s, %s, %s, %s, %s, %s)"
    values = (book_id,title,author,genre,published_year,is_available) 
    try: 
        mycursor.execute(query, values) 
        mydb.commit() 
        print("Book inserted successfully.") 
    except mysql.connector.Error as err: 
        print(f"Error inserting book: {err}") 
 
insert_Books("4","1984", "George Orwell", "Dystopian Fiction", "1949", True)

Book inserted successfully.

In [11]:
def insert_Books(book_id,title,author,genre,published_year,is_available): 
    query = "INSERT INTO Books (book_id, title, author, genre, published_year, is_available) " \
            "VALUES (%s, %s, %s, %s, %s, %s)"
    values = (book_id,title,author,genre,published_year,is_available) 
    try: 
        mycursor.execute(query, values) 
        mydb.commit() 
        print("Book inserted successfully.") 
    except mysql.connector.Error as err: 
        print(f"Error inserting book: {err}") 
 
insert_Books("5","The Midnight Library", "Matt Haig", "Fiction", "2020", False)

Book inserted successfully.

In [12]:
def print_order():
    query = "SELECT * FROM Books ORDER BY book_id"

    mycursor.execute(query)

    myresult = mycursor.fetchall()
    print(myresult)
print_order()

[(1, 'Sapiens', 'Yuval Noah Harari', 'History', 2011, 1), (2, 'The Jungle Book', 'Rudyard Kipling', 'Fable', 2025, 1), (3, 'The Silent Patient', 'Alex Michaelides', 'Psychological Thriller', 2019, 1), (4, '1984', 'George Orwell', 'Dystopian Fiction', 1949, 1), (5, 'The Midnight Library', 'Matt Haig', 'Fiction', 2020, 0)]

In [13]:
mycursor.execute("SELECT * FROM Books") 
  
# fetch all the matching rows  
result = mycursor.fetchall() 
  
# loop through the rows 
for row in result: 
    print(row) 
    print("\n")

(1, 'Sapiens', 'Yuval Noah Harari', 'History', 2011, 1)


(2, 'The Jungle Book', 'Rudyard Kipling', 'Fable', 2025, 1)


(3, 'The Silent Patient', 'Alex Michaelides', 'Psychological Thriller', 2019, 1)


(4, '1984', 'George Orwell', 'Dystopian Fiction', 1949, 1)


(5, 'The Midnight Library', 'Matt Haig', 'Fiction', 2020, 0)

In [14]:
mycursor.execute("SELECT * FROM Books")

myresult = mycursor.fetchall()

header = ['book_id', 'title', 'author', 'genre', 'published_year', 'is_available']
print("|{:10}|{:20}|{:19}|{:22}|{:14}|{:9}|".format(*header))
for j in result:
    print("|{:10}|{:20}|{:19}|{:22}|{:14}|{:12}|".format(*j))

|book_id   |title               |author             |genre                 |published_year|is_available|
|         1|Sapiens             |Yuval Noah Harari  |History               |          2011|           1|
|         2|The Jungle Book     |Rudyard Kipling    |Fable                 |          2025|           1|
|         3|The Silent Patient  |Alex Michaelides   |Psychological Thriller|          2019|           1|
|         4|1984                |George Orwell      |Dystopian Fiction     |          1949|           1|
|         5|The Midnight Library|Matt Haig          |Fiction               |          2020|           0|

In [15]:
mycursor = mydb.cursor()

sql = "DROP TABLE IF EXISTS Members"

mycursor.execute(sql)

In [16]:
query = """
CREATE TABLE Members (
    member_id INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    email VARCHAR(255),
    phone_number VARCHAR(15),
    join_date DATE DEFAULT (CURRENT_DATE)
);
"""
mycursor.execute(query)

In [17]:
def insert_Members(member_id,name,email,phone_number,join_date): 
    query = "INSERT INTO Members (member_id,name,email,phone_number,join_date) " \
            "VALUES (%s, %s, %s, %s, %s, %s)"
    values = (member_id,name,email,phone_number,join_date) 
    try: 
        mycursor.execute(query, values) 
        mydb.commit() 
        print("Book inserted successfully.") 
    except mysql.connector.Error as err: 
        print(f"Error inserting book: {err}")

In [18]:
query = """
INSERT INTO Members (name, email, phone_number) VALUES
('Alen King', 'alenking@example.com', '1234567890'),
('Alece Hofman', 'alecehofman@example.com', '9876543210');
"""
mycursor.execute(query)

In [19]:
def print_order():
    query = "SELECT * FROM Members ORDER BY member_id"

    mycursor.execute(query)

    myresult = mycursor.fetchall()
    print(myresult)
print_order()

[(1, 'Alen King', 'alenking@example.com', '1234567890', datetime.date(2025, 7, 18)), (2, 'Alece Hofman', 'alecehofman@example.com', '9876543210', datetime.date(2025, 7, 18))]

In [20]:
mycursor.execute("SELECT * FROM Members") 
result = mycursor.fetchall() 
for row in result: 
    print(row) 
    print("\n")

(1, 'Alen King', 'alenking@example.com', '1234567890', datetime.date(2025, 7, 18))


(2, 'Alece Hofman', 'alecehofman@example.com', '9876543210', datetime.date(2025, 7, 18))

In [21]:
mycursor.execute("SELECT * FROM Members")

myresult = mycursor.fetchall()

header = ['member_id','name','email','phone_number','join_date']
print("|{:10}|{:13}|{:23}|{:22}|{:10}|".format(*header))
for j in result:
    print("|{:10}|{:13}|{:23}|{:22}|{:}|".format(*j))

|member_id |name         |email                  |phone_number          |join_date |
|         1|Alen King    |alenking@example.com   |1234567890            |2025-07-18|
|         2|Alece Hofman |alecehofman@example.com|9876543210            |2025-07-18|

In [22]:
mycursor = mydb.cursor()

sql = "DROP TABLE IF EXISTS Borrowing"

mycursor.execute(sql)

In [23]:
query = """
CREATE TABLE Borrowing (
    loan_id INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
    book_id INT,
    member_id INT,
    borrow_date DATE DEFAULT (CURRENT_DATE),
    return_date DATE);
"""

mycursor.execute(query)

In [24]:
def insert_Borrowing (loan_id,book_id,member_id,borrow_id,return_date): 
    query = "INSERT INTO Members (loan_id,book_id,member_id,borrow_id,return_date) " \
            "VALUES (%s, %s, %s, %s, %s, %s)"
    values = (loan_id,book_id,member_id,borrow_id,return_date) 
    try: 
        mycursor.execute(query, values) 
        mydb.commit() 
        print("Book inserted successfully.") 
    except mysql.connector.Error as err: 
        print(f"Error inserting book: {err}")

In [25]:
query = """
INSERT INTO Borrowing (book_id, member_id,borrow_date)
VALUES (1, 1, CURRENT_DATE),(3,2, CURRENT_DATE);
"""
mycursor.execute(query)

In [26]:
def print_order():
    query = "SELECT * FROM Borrowing ORDER BY book_id"

    mycursor.execute(query)

    myresult = mycursor.fetchall()
    print(myresult)
print_order()

[(1, 1, 1, datetime.date(2025, 7, 18), None), (2, 3, 2, datetime.date(2025, 7, 18), None)]

In [27]:
mycursor.execute("SELECT * FROM Borrowing")

myresult = mycursor.fetchall()

header = ['loan_id','book_id','member_id','borrow_id','return_date']
print("|{:10}|{:13}|{:23}|{:22}|{:10}|".format(*header))
for j in result:
    print("|{:10}|{:13}|{:23}|{:22}|{:}|".format(*j))

|loan_id   |book_id      |member_id              |borrow_id             |return_date|
|         1|Alen King    |alenking@example.com   |1234567890            |2025-07-18|
|         2|Alece Hofman |alecehofman@example.com|9876543210            |2025-07-18|

In [34]:
mycursor.execute("SELECT * FROM Books WHERE Book_id = 5")
result = mycursor.fetchone()
print(result)

(5, 'The Midnight Library', 'Matt Haig', 'Fiction', 2020, 0)

In [30]:
def delete_value ():
     mycursor = mydb.cursor()
     sql = "DELETE FROM Books WHERE genre= 'History'"

     mycursor.execute(sql)

     mydb.commit()

print (mycursor.rowcount, "record(s) deleted")
delete_value()

2 record(s) deleted